{
    "builds": [
        {
            "version": "5.0.2",
            "date": "15/07/2019",
            "title": "Reload config",
            "description": "If your username or password is null, you can no press Reload Config to fetch Bugzilla Live configuration, without needing to restart the application."
        },
        {
            "version": "5.0.1",
            "date": "12/07/2019",
            "title": "Fixes",
            "description": "Authentication errors are now shown in the GUI if there is a problem when trying to get ORs.*Changing themes are now saved so your theme is saved when opening Bugzilla again.*The URL for Bugzilla is now retrieved from the config service, so it can be changed in the application.properties file without having to rebuild and redeploy Bugzilla Live."
        },
        {
            "version": "5.0.0",
            "date": "08/07/2019",
            "title": "Themes",
            "description": "You can now change the colours of the information pane texts as well as the background.*The help menu will now open in the Wiki.*You can now customise Bugzilla Live from a set of pre-built themes."
        },
        {
            "version": "4.3.1",
            "date": "26/06/2019",
            "title": "Bugs and performance",
            "description": "Performance improvements."
        },
        {
            "version": "4.3.0",
            "date": "03/06/2019",
            "title": "New application bar",
            "description": "The main toolbar at the top of Bugzilla Live is now colour customisable."
        },
        {
            "version": "4.2.0",
            "date": "23/05/2019",
            "title": "New clipboard copies",
            "description": "Generating a unit test now automatically copies the unit test file name to the clipboard.*Copy the title of an OR by right clicking on an OR and choosing to copy the title."
        },
        {
            "version": "4.1.0",
            "date": "13/04/2019",
            "title": "Coded ORs",
            "description": "Changing the status of an OR to coded will automatically change the comment to the Coded template."
        },
        {
            "version": "4.0.0",
            "date": "10/04/2019",
            "title": "OR management",
            "description": "You can now add a comment to an OR from within the application.*You can now change the status of an OR from within the application.*The OR micro service for Bugzilla Live has been converted to Python."
        },
        {
            "version": "3.1.0",
            "date": "27/02/2019",
            "title": "New font",
            "description": "Code updates and a new font for Bugzilla Live."
        },
        {
            "version": "3.0.0",
            "date": "22/02/2019",
            "title": "OR table filers & pause refreshing",
            "description": "You can now type text into the filter field, and the table will auto filter ORs to match the filter.*Refreshing can now be paused."
        },
        {
            "version": "2.5.0",
            "date": "10/02/2019",
            "title": "Process improvements & new About dialog",
            "description": "Changed the layout of the About dialog.*Fixed an issue where some requests would return a 'null' error."
        },
        {
            "version": "2.4.0",
            "date": "31/01/2019",
            "title": "Fixes for getting ORs and colour improvements",
            "description": "Fixed an issue where selecting 'Get My ORs' would not get new ORs assigned to you after pressing the refresh button.*Fixed an issue where changing the colour for any part of the application would turn some ORs pink."
        },
        {
            "version": "2.3.2",
            "date": "28/01/2019",
            "title": "External lists fixes",
            "description": "Fixed an issue where you could not view an external list and instead got an exception."
        },
        {
            "version": "2.3.1",
            "date": "19/01/2019",
            "title": "Subsystem tests",
            "description": "You can now create subsystem test documents (currently only for CRM) from one or more ORs in the table."
        },
        {
            "version": "2.3.0",
            "date": "17/01/2019",
            "title": "Unit tests & release notes",
            "description": "You can now create unit test documents from an OR in the table.*You can now create release notes (currently only CRM) from one or more ORs in the table.*Fixed an issue where adding or removing an OR from a list would cause an error.*Fixed an issue where creating a new OR list would cause an error."
        },
        {
            "version": "2.2.2",
            "date": "28/12/2018",
            "title": "Custom colours",
            "description": "Added a colour chooser to define your own colours for window bars and OR colours.*Added theme icon for colour choose option.*Updated shortcut to use correct icon file."
        },
        {
            "version": "2.2.1",
            "date": "26/12/2018",
            "title": "GUI updates & new shortcut",
            "description": "Added cancel buttons to popup windows.*Re-skinned application to use custom tool bars.*Updated shortcut so that application is always run in administrator mode."
        },
        {
            "version": "2.2.0",
            "date": "16/12/2018",
            "title": "New GUI",
            "description": "Redesigned the entire application."
        },
        {
            "version": "2.1.1",
            "date": "14/12/2018",
            "title": "Small fixes",
            "description": "Windows such as the 'Add OR' and 'Create List' display relevant icons.*The correct title is displayed in the information pane when changing from ORs in a list to user ORs."
        },
        {
            "version": "2.1.0",
            "date": "07/12/2018",
            "title": "New icons",
            "description": "Updated all the icons used by Bugzilla Live."
        },
        {
            "version": "2.0.3",
            "date": "07/12/2018",
            "title": "GUI updates & improvements",
            "description": "Added 'About' to see the latest release information on Bugzilla LIVE.*Moved 'Get My ORs' and 'Get User ORs' into the same section.*Navbar Search and Firefox now use just icons.*The OR table can now be copied to the clipboard.*Fixed an issue with the list response message.*Added 'Last Updated' to the sort menu, and some fields now sort in a certain order, for example 'Severity' ascending is sorted Investigation, Diagnosed... instead of alphabetical.*OR comments now display the number in the dialog name.*The Information Pane wraps the text, so the file name can be seen if it is long.*Unrecognised file types now shown 'Unknown File Type' instead of 'null'.*OR service no longer fails if no ORs are retrieved.*Choosing to 'Get My ORs' now refreshes in such a way so that new ORs assigned to you are automatically displayed on the next refresh of your ORs."
        },
        {
            "version": "2.0.2",
            "date": "30/11/2018",
            "title": "External lists + excel exports",
            "description": "Added comment icon for the context menu.*You can now export the OR table to an excel spreadsheet using 'File->Export to Excel'.*External lists now refresh properly and will pick up changes made by other people."
        },
        {
            "version": "2.0.1",
            "date": "30/11/2018",
            "title": "OR comments",
            "description": "Comments encode correctly and longer show symbols instead of punctuation.*'Last Updated' column now shows 24-hour clock."
        },
        {
            "version": "2.0.0",
            "date": "30/11/2018",
            "title": "Refreshing tables",
            "description": "Table now refreshes when creating a new list.*Table shows a 'Please Wait' message when changing source of ORs.*Message boxes are shown if a microservice reports a failure.*Comments and attachments for ORs now available."
        }
    ]
}